name: "kosmos2"
backend: "python"
max_batch_size: 0

input [
  {
    name: "image"
    data_type: TYPE_UINT8
    dims: [ -1 ]
  },
  {
    name: "prompt"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

output [
  {
    name: "generated_text"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_GPU
  }
]

dynamic_batching {
  max_queue_delay_microseconds: 100
}
